# IMPORT LIBRARIES

In [1]:
import pandas as pd
import numpy as np

# READING DATA FROM SOURCE

In [14]:
dfCustomers = pd.read_csv("customers.csv", delimiter = ",")
dfCustomers.set_index("CLIENT_ID", inplace = True)

In [15]:
dfCustomers.head()

           ACCOUNT_ID GENDER  BIRTH_DT  ACTIVE  LOAN  DISTRICT_ID SET_SPLIT
CLIENT_ID
1                   1      F  19701213       1   0.0           18     TRAIN
2                   2      M  19450204       1   1.0            1     TRAIN
4                   3      M  19561201       1   0.0            5      TEST
7                   5      M  19290125       1   0.0           15     TRAIN
8                   6      F  19380221       1   0.0           51     TRAIN

In [4]:
dfTransactions = pd.read_csv("transactions.csv", delimiter = ",")
dfTransactions.set_index("TRANS_ID", inplace = True)

In [5]:
dfTransactions.head()

          ACCOUNT_ID     DATE  AMOUNT  BALANCE    TYPE       OPERATION
TRANS_ID
695247        2378.0  1011993   700.0    700.0  CREDIT  CREDIT_IN_CASH
171812         576.0  1011993   900.0    900.0  CREDIT  CREDIT_IN_CASH
207264         704.0  1011993  1000.0   1000.0  CREDIT  CREDIT_IN_CASH
1117247       3818.0  1011993   600.0    600.0  CREDIT  CREDIT_IN_CASH
579373        1972.0  2011993   400.0    400.0  CREDIT  CREDIT_IN_CASH

In [6]:
dfDistricts =  pd.read_csv("districts.csv", delimiter = ",")
dfDistricts.set_index("DISTRICT_ID", inplace = True)

In [7]:
dfDistricts.head()

,N_INHAB,N_CITIES,URBAN_RATIO,AVG_SALARY,UNEMP_95,UNEMP_96,N_ENTR,CRIME_95,CRIME_96
DISTRICT_ID,,,,,,,,,
1,1204953,1,100.0,12541,0.29,0.43,167,85677,99107
2,88884,5,46.7,8507,1.67,1.85,132,2159,2674
3,75232,5,41.7,8980,1.95,2.21,111,2824,2813
4,149893,6,67.4,9753,4.64,5.05,109,5244,5892
5,95616,6,51.4,9307,3.85,4.43,118,2616,3040

# DATA EXPLORATION

## Exploring Data Types

### dfCustomers

"LOAN" field should be either 1 or 0 by description. Usually such fields have integer data types. However, it looks as float64, it s a sign that this field can include some unexpected data.

In [8]:
dfCustomers.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4450 entries, 1 to 13998
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ACCOUNT_ID   4450 non-null   int64
 1   GENDER       4450 non-null   object
 2   BIRTH_DT     4450 non-null   int64
 3   ACTIVE       4450 non-null   int64
 4   LOAN         4400 non-null   float64
 5   DISTRICT_ID  4450 non-null   int64
 6   SET_SPLIT    4450 non-null   object
dtypes: float64(1), int64(4), object(2)
memory usage: 278.1+ KB

Confirming that each client has only 1 account id in dfCustomers dataset.

In [65]:
len(dfCustomers.index.unique()) == len(dfCustomers["ACCOUNT_ID"].unique())

True

### dfDistricts

"UNEMP_95" and "CRIME_95" fields look as object data type. By description of field, "UNEMP_95" should represent unemployment ratio which is float, however it looks as object. Similarly, "CRIME_95" field represents number of committed crimes which should be in integer type. However, it also looks as object. These are signs that, the fields of "UNEMP_95" and "CRIME_95" contain some unexpected data.

In [9]:
dfDistricts.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 77 entries, 1 to 77
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   N_INHAB      77 non-null     int64
 1   N_CITIES     77 non-null     int64
 2   URBAN_RATIO  77 non-null     float64
 3   AVG_SALARY   77 non-null     int64
 4   UNEMP_95     77 non-null     object
 5   UNEMP_96     77 non-null     float64
 6   N_ENTR       77 non-null     int64
 7   CRIME_95     77 non-null     object
 8   CRIME_96     77 non-null     int64
dtypes: float64(2), int64(5), object(2)
memory usage: 6.0+ KB

### dfTransactions

In [10]:
dfTransactions.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1066320 entries, 695247 to 3624981
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   ACCOUNT_ID  1061320 non-null  float64
 1   DATE        1066320 non-null  int64
 2   AMOUNT      1066320 non-null  float64
 3   BALANCE     1066320 non-null  float64
 4   TYPE        1066320 non-null  object
 5   OPERATION   881436 non-null   object
dtypes: float64(3), int64(1), object(2)
memory usage: 56.9+ MB

## Exploring Missing Data

### dfCustomers

Only field 'LOAN' includes NaN values in dfCustomers dataframe.

In [11]:
dfCustomers.columns[dfCustomers.isna().any()].tolist()

['LOAN']

Checking unique fields to be sure if any other missing values except NaN. Unique values are sorted to detect missing values on the boundaries of the sorted array.

In [18]:
np.sort(dfCustomers.index.unique())

array([    1,     2,     4, ..., 13968, 13971, 13998], dtype=int64)

In [19]:
np.sort(dfCustomers["ACCOUNT_ID"].unique())

array([    1,     2,     3, ..., 11359, 11362, 11382], dtype=int64)

In [20]:
np.sort(dfCustomers["GENDER"].unique())

array(['F', 'M'], dtype=object)

In [21]:
np.sort(dfCustomers["BIRTH_DT"].unique())

array([19180107, 19180111, 19180116, ..., 19821005, 19821020, 19821211],
      dtype=int64)

In [22]:
np.sort(dfCustomers["ACTIVE"].unique())

array([1], dtype=int64)

In [23]:
np.sort(dfCustomers["LOAN"].unique())

array([ 0.,  1., nan])

In [24]:
np.sort(dfCustomers["DISTRICT_ID"].unique())

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71, 72, 73, 74, 75, 76, 77], dtype=int64)

In [25]:
np.sort(dfCustomers["SET_SPLIT"].unique())

array(['TEST', 'TRAIN'], dtype=object)

### dfDistricts

Looks like there is no field that contains NaN value in dfDistricts.

In [26]:
dfDistricts.columns[dfDistricts.isna().any()].tolist()

[]

Checking unique fields to be sure if any other missing values except NaN. Unique values are sorted to detect missing values on the boundaries of the sorted array.

In [28]:
np.sort(dfDistricts.index.unique())

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71, 72, 73, 74, 75, 76, 77], dtype=int64)

In [29]:
np.sort(dfDistricts["N_INHAB"].unique())

array([  42821,   45714,   51313,   51428,   53921,   58400,   58796,
         67298,   70646,   70699,   72541,   74062,   75232,   75637,
         75685,   77917,   77963,   78955,   81344,   85852,   86513,
         87419,   88757,   88768,   88884,   92084,   93931,   94725,
         94812,   95616,   95907,  102609,  103347,  105058,  105606,
        106054,  107870,  107911,  108871,  109164,  110643,  112065,
        112709,  114006,  114200,  117897,  118650,  119895,  121947,
        122603,  124605,  125236,  125832,  127369,  128118,  133777,
        138032,  139012,  145688,  148545,  149893,  157042,  159617,
        161227,  161854,  161954,  162580,  170449,  177686,  182027,
        197099,  226122,  228848,  285387,  323870,  387570, 1204953],
      dtype=int64)

In [30]:
np.sort(dfDistricts["N_CITIES"].unique())

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11], dtype=int64)

In [31]:
np.sort(dfDistricts["URBAN_RATIO"].unique())

array([ 33.9,  36.5,  36.9,  40.7,  41.3,  41.7,  43.7,  43.8,  46. ,
        46.7,  48. ,  48.3,  48.4,  50.5,  50.9,  51.2,  51.4,  51.5,
        51.9,  52. ,  52.4,  52.7,  53. ,  53.5,  53.8,  55.3,  55.6,
        56.4,  56.9,  57.2,  58. ,  58.4,  59. ,  59.1,  59.2,  59.8,
        60.8,  61.4,  61.7,  61.9,  62.1,  62.3,  62.6,  63.1,  63.4,
        63.6,  64.6,  65.3,  67. ,  67.4,  69.4,  69.7,  70.5,  72.8,
        73.5,  74.7,  74.8,  76.3,  80. ,  80.5,  81. ,  81.8,  84.7,
        85.2,  85.3,  85.5,  85.6,  87.7,  89.9, 100. ])

In [32]:
np.sort(dfDistricts["AVG_SALARY"].unique())

array([ 8110,  8114,  8173,  8187,  8208,  8240,  8254,  8288,  8363,
        8369,  8388,  8390,  8402,  8403,  8427,  8441,  8444,  8507,
        8512,  8541,  8544,  8546,  8547,  8554,  8561,  8594,  8598,
        8620,  8624,  8678,  8705,  8720,  8743,  8746,  8754,  8757,
        8772,  8814,  8819,  8843,  8867,  8899,  8909,  8930,  8965,
        8968,  8980,  8991,  8994,  9045,  9060,  9065,  9104,  9198,
        9272,  9307,  9317,  9425,  9538,  9622,  9624,  9650,  9675,
        9753,  9832,  9893,  9897,  9920, 10045, 10124, 10177, 10446,
       10673, 10787, 11277, 12541], dtype=int64)

"UNEMP_95" field contains value of question mark character '?'.

In [33]:
np.sort(dfDistricts["UNEMP_95"].unique())

array(['0.29', '0.45', '0.56', '0.65', '1.02', '1.10', '1.12', '1.25',
       '1.29', '1.39', '1.42', '1.51', '1.60', '1.62', '1.67', '1.72',
       '1.78', '1.79', '1.88', '1.89', '1.95', '2.26', '2.28', '2.38',
       '2.41', '2.47', '2.51', '2.52', '2.53', '2.64', '2.65', '2.77',
       '2.79', '2.80', '2.82', '2.83', '2.95', '3.13', '3.24', '3.32',
       '3.33', '3.38', '3.39', '3.45', '3.51', '3.52', '3.73', '3.79',
       '3.80', '3.83', '3.85', '4.01', '4.09', '4.46', '4.64', '4.69',
       '4.73', '4.75', '4.76', '4.83', '5.38', '5.74', '5.75', '5.77',
       '5.93', '6.43', '6.49', '6.63', '7.08', '7.34', '?'], dtype=object)

In [34]:
np.sort(dfDistricts["UNEMP_96"].unique())

array([0.43, 0.54, 0.59, 1.21, 1.25, 1.29, 1.44, 1.54, 1.71, 1.81, 1.85,
       1.86, 1.96, 2.01, 2.07, 2.21, 2.26, 2.31, 2.43, 2.44, 2.5 , 2.62,
       2.66, 2.68, 2.87, 2.89, 2.94, 2.97, 3.09, 3.22, 3.26, 3.35, 3.47,
       3.49, 3.56, 3.6 , 3.64, 3.67, 3.74, 3.76, 3.95, 3.97, 3.98, 4.02,
       4.12, 4.2 , 4.28, 4.31, 4.43, 4.48, 4.5 , 4.52, 4.72, 4.79, 4.98,
       5.05, 5.39, 5.44, 5.45, 5.56, 5.57, 5.66, 5.72, 5.74, 5.88, 6.55,
       7.01, 7.07, 7.61, 7.68, 7.75, 8.23, 9.4 ])

In [35]:
np.sort(dfDistricts["N_ENTR"].unique())

array([ 81,  87,  90,  94,  96,  97,  99, 100, 102, 104, 105, 106, 107,
       108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120,
       123, 124, 125, 126, 127, 128, 130, 131, 132, 135, 137, 140, 141,
       145, 149, 154, 155, 167], dtype=int64)

"CRIME_95" field contains value of question mark character '?'.

In [36]:
np.sort(dfDistricts["CRIME_95"].unique())

array(['1003', '1029', '1089', '1328', '1562', '1563', '1580', '1597',
       '1655', '1658', '1660', '1740', '1822', '1845', '1850', '18721',
       '1874', '18782', '1879', '2080', '2112', '2123', '2157', '2159',
       '2166', '2212', '2247', '2299', '2564', '2595', '2616', '2640',
       '2653', '2719', '2824', '2854', '2879', '2985', '2987', '3244',
       '3384', '3460', '3475', '3496', '3659', '3729', '3736', '3804',
       '3810', '4063', '4085', '4147', '4289', '4340', '4355', '4484',
       '4650', '4947', '4980', '5179', '5198', '5244', '5323', '5623',
       '5796', '6041', '6079', '6445', '6604', '6949', '818', '85677',
       '9672', '9878', '999', '?'], dtype=object)

In [37]:
np.sort(dfDistricts["CRIME_96"].unique())

array([  888,  1099,  1117,  1127,  1181,  1358,  1452,  1460,  1525,
        1542,  1668,  1717,  1875,  1879,  1903,  1910,  1913,  2059,
        2103,  2122,  2123,  2134,  2218,  2252,  2305,  2325,  2354,
        2471,  2487,  2618,  2674,  2718,  2799,  2804,  2807,  2813,
        2822,  2906,  3040,  3079,  3120,  3158,  3198,  3529,  3590,
        3620,  3651,  3839,  3868,  3891,  3894,  4166,  4265,  4316,
        4433,  4505,  4595,  4743,  4846,  4859,  4987,  5190,  5273,
        5410,  5471,  5887,  5892,  6132,  6261,  6295,  6872,  9208,
       10108, 18347, 18696, 99107], dtype=int64)

### dfTransactions

"ACCOUNT_ID" and "OPERATION" operation fields contain NaN values.

In [38]:
dfTransactions.columns[dfTransactions.isna().any()].tolist()

['ACCOUNT_ID', 'OPERATION']

In [40]:
np.sort(dfTransactions.index.unique())

array([      1,       5,       6, ..., 3682985, 3682986, 3682987],
      dtype=int64)

"ACCOUNT_ID" field contains NaN values.

In [41]:
np.sort(dfTransactions["ACCOUNT_ID"].unique())

array([1.0000e+00, 2.0000e+00, 3.0000e+00, ..., 1.1362e+04, 1.1382e+04,
              nan])

"DATE" field doesn't contain NaN value but date format is not in MMDDYYY format for some values. Looks like instead of YYY, some of them have YYYY.

In [42]:
np.sort(dfTransactions["DATE"].unique())

array([ 1011993,  1011994,  1011995, ..., 31121996, 31121997, 31121998],
      dtype=int64)

In [43]:
np.sort(dfTransactions["AMOUNT"].unique())

array([0.00e+00, 1.00e-01, 2.00e-01, ..., 8.64e+04, 8.73e+04, 8.74e+04])

In [44]:
np.sort(dfTransactions["BALANCE"].unique())

array([-41125.7, -40938.4, -40817. , ..., 194119.3, 196106.5, 209637. ])

In [45]:
np.sort(dfTransactions["TYPE"].unique())

array(['CREDIT', 'WITHDRAWAL'], dtype=object)

"ACCOUNT_ID" field contains NaN values.

In [46]:
dfTransactions["OPERATION"].unique()

array(['CREDIT_IN_CASH', 'COLLECTION_FROM_OTHER_BANK', nan,
       'WITHDRAWAL_IN_CASH', 'REMITTANCE_TO_OTHER_BANK', 'CC_WITHDRAWAL'],
      dtype=object)

# PREPROCESSING

Data preprocessing is applied to the copied datasets since some fields may be good enough for exploratory analysis but not complied for predictive model. That's why, preprocessing is applied only to the datasets that will be used in predictive models.

In [47]:
dfCustomersModel = dfCustomers.copy()
dfTransactionsModel = dfTransactions.copy()
dfDistrictsModel = dfDistricts.copy()

## Missing Data Handling

### LOAN

There are 50 customers which have NaN value on their "LOAN" field. Empty "LOAN" data can't be used for training or testing purposes. That's why, the customers which don't have "LOAN" information are dropped from dfCustomersModel and dfTransactionsModel datasets.

In [106]:
dfCustomersMissingLoan = dfCustomers[dfCustomers["LOAN"].isna()]

dfTransactionsMissingLoan = dfTransactions.reset_index().merge(
    dfCustomersMissingLoan, 
    how = "inner", 
    on = "ACCOUNT_ID").set_index("TRANS_ID")


dfTransactionsModel.drop(dfTransactionsMissingLoan.index, inplace = True)
dfCustomersModel.drop(dfCustomersMissingLoan.index, inplace = True)

### UNEMP_95